content/uses.md
+++
title = "Uses"
author = ["Marcus Crane"]
draft = false
hidedate = true
+++

See [here](https://uses.tech/) for context


## Development tools {#development-tools}


### Editor {#editor}

[Doom Emacs](https://github.com/hlissner/doom-emacs) is my current [Emacs](https://www.gnu.org/software/emacs/) distribution of choice

I'm still relatively new to the ecosystem so if I find myself frustrated or want to make a quick edit, I'll generally reach for [VS Code](https://code.visualstudio.com/), [Sublime Text](https://www.sublimetext.com/) or [nvim](https://neovim.io/)


### Terminal {#terminal}

-   macOS: Terminal with minimal configuration
-   Windows: Windows Terminal or stock Ubuntu WSL

I use stock [zsh](https://en.wikipedia.org/wiki/Z%5Fshell) (not oh-my-zsh) with a profile that is shared across all of my development environments via Git

I'm looking at switching back to [fish](https://fishshell.com/) shortly and ideally having my configuration kept as a literate document ([tangled](https://www.gnu.org/software/emacs/manual/html%5Fnode/org/Extracting-source-code.html) by Emacs)

For both of my Windows environments, I do all of my development using version 2 of the [Windows Subsystem for Linux](https://docs.microsoft.com/en-us/windows/wsl/faq)


### Hardware {#hardware}

-   Work laptop: [HP ZBook Studio G5](https://store.hp.com/us/en/pdp/hp-zbook-studio-g5-mobile-workstation-customizable-2yn59av-mb) running Windows 10 Enterprise
-   Home laptop: [Macbook Pro 13 (Early 2015)](https://support.apple.com/kb/sp715) running [macOS Big Sur](https://www.apple.com/macos/big-sur-preview/) Developer Preview
-   Home desktop: Custom built running Windows 10 Pro Insiders
